<?php

App::uses('AppController', 'Controller');

class BetweenController extends AppController {

	public function beforeFilter() {
		parent::beforeFilter();

		$this->select_districts = array(
			__('港島區') => array(
				__('薄扶林') => __('薄扶林'),
				__('半山') => __('半山'),
				__('西環') => __('西環'),
				__('中上環') => __('中上環'),
				__('灣仔') => __('灣仔'),
				__('銅鑼灣') => __('銅鑼灣'),
				__('跑馬地') => __('跑馬地'),
				__('北角') => __('北角'),
				__('則魚涌') => __('則魚涌'),
				__('太古') => __('太古'),
				__('筲箕灣') => __('筲箕灣'),
				__('西灣河') => __('西灣河'),
				__('香港仔') => __('香港仔'),
				__('鴨利洲') => __('鴨利洲'),
				__('赤柱') => __('赤柱')
    		),
    		__('九龍區') => array(
				__('藍田') => __('藍田'),
				__('油塘') => __('油塘'),
				__('秀茂坪') => __('秀茂坪'),
				__('牛頭角') => __('牛頭角'),
				__('九龍灣') => __('九龍灣'),
				__('彩虹') => __('彩虹'),
				__('牛池灣') => __('牛池灣'),
				__('慈雲山') => __('慈雲山'),
				__('鑽石山') => __('鑽石山'),
				__('新蒲崗') => __('新蒲崗'),
				__('黃大仙') => __('黃大仙'),
				__('樂富') => __('樂富'),
				__('九龍塘') => __('九龍塘'),
				__('石硤尾') => __('石硤尾'),
				__('何文田') => __('何文田'),
				__('九龍城') => __('九龍城'),
				__('土瓜灣') => __('土瓜灣'),
				__('紅磡') => __('紅磡'),
				__('油麻地') => __('油麻地'),
				__('佐敦') => __('佐敦'),
				__('尖沙咀') => __('尖沙咀'),
				__('旺角') => __('旺角'),
				__('大角咀') => __('大角咀'),
				__('深水步') => __('深水步'),
				__('長沙灣') => __('長沙灣'),
				__('荔枝角') => __('荔枝角'),
				__('美孚') => __('美孚'),
    		),  
			__('新界區') => array(
				__('將軍澳') => __('將軍澳'),
				__('西貢') => __('西貢'),
				__('荃灣') => __('荃灣'),
				__('深井') => __('深井'),
				__('馬灣') => __('馬灣'),
				__('葵涌') => __('葵涌'),
				__('葵芳') => __('葵芳'),
				__('青衣') => __('青衣'),
				__('大圍') => __('大圍'),
				__('沙田') => __('沙田'),
				__('沙田市中心') => __('沙田市中心'),
				__('火炭') => __('火炭'),
				__('馬鞍山') => __('馬鞍山'),
				__('大埔') => __('大埔'),
				__('粉嶺') => __('粉嶺'),
				__('上水') => __('上水'),
				__('元朗') => __('元朗'),
				__('天水圍') => __('天水圍'),
				__('屯門') => __('屯門'),
				__('離島') => __('離島（除東涌）'),
				__('東涌') => __('東涌')
    		) 
		);

		//Subjects
		//$this->loadModel('Subject');
		//$this->Subject->contain();
		//$options = array(
		//	'order' => array('Subject.catno ASC')
		//);
		//$this->subjectsname = $this->Subject->find('all', $options);	
		//$this->select_subjects = array();
		//foreach($this->subjectsname as $key => $value) {
		//	$this->select_subjects[$value['Subject']['cat']][$value['Subject']['id']] = $value['Subject']['name'];		
		//}



		$this->select_subjects = array(
			'小學' => array(
				'29' => __('全科'), 
				'30' => __('中文'),
				'31' => __('英文'),
				'32' => __('數學'),
				'33' => __('常識')
			),
			'中學（初中及DSE）' => array(
				'1' => __('全科'), 
				'2' => __('中文'),
				'3' => __('英文'),
				'4' => __('數學'),
				'5' => __('數學（M1）'),
				'6' => __('數學（M2）'),
				'7' => __('中國文學'),
				'8' => __('英國文學'),
				'9' => __('中國歷史'),
				'10' => __('世界歷史'),
				'11' => __('地理'),
				'12' => __('通識'),
				'13' => __('綜合科學'),
				'14' => __('綜合人民'),
				'15' => __('附加數學'),
				'16' => __('純粹數學'),
				'17' => __('應用數學'),
				'18' => __('物理'),
				'19' => __('生物'),
				'20' => __('化學'),
				'21' => __('商業'),
				'22' => __('會計'),
				'23' => __('經濟'),
				'24' => __('企業概論'),
				'25' => __('政府及公共事務'),
				'26' => __('統計學'),
				'27' => __('BAFS'),
				'28' => __('電腦')
			),
			'IB MYP/Diploma' => array(
				'48' => __('全科'), 
				'49' => __('中文'),
				'50' => __('中國文學'),					
				'51' => __('英文'),
				'52' => __('英國文學'),					
				'53' => __('數學'),
				'54' => __('歷史'),
				'55' => __('地理'),
				'56' => __('經濟'),
				'57' => __('哲學'),
				'58' => __('心理學'),
				'59' => __('電腦'),
				'60' => __('科學'),					
				'61' => __('物理'),
				'62' => __('化學'),
				'63' => __('生物'),
				'64' => __('環境系統'),
				'65' => __('藝術/美術設計'),
				'66' => __('音樂'),
				'67' => __('戲劇藝術'),
				'68' => __('拓展論文（EE）'),
				'69' => __('知識論文（TOK）')
			),				
			'公開試（除 DSE 及 IB）及會話' => array(
				'79' => __('Phonics/英文拼音'), 
				'80' => __('Trinity GESE'),					
				'34' => __('Cambridge YLE Starters'), 
				'35' => __('Cambridge YLE Movers'),
				'36' => __('Cambridge YLE Flyers'),
				'37' => __('Cambridge KET'),
				'38' => __('Cambridge PET'),
				'39' => __('Cambridge FCE'),	
				'40' => __('Cambridge CAE'),
				'41' => __('Cambridge CPE'),
				'42' => __('Cambridge IELTS'),
				'43' => __('TOEFL'),
				'44' => __('TOEFL Junior'),
				'45' => __('Common Entrance 13+'),
				'46' => __('GCE'),
				'47' => __('GCSE'),
				'70' => __('普通話'), 
				'71' => __('廣東話'),
				'72' => __('英語'),					
				'73' => __('日語'),
				'74' => __('韓語'),
				'75' => __('法語'),
				'76' => __('意大利語'),	
				'77' => __('德語'),
				'78' => __('西班牙語')
			)
		);	

	    $this->select_grade = array(
			__('1') => __('Pre-School'),	    		
	    	__('2') => __('K1'),
	    	__('3') => __('K2'),
	    	__('4') => __('K3'),	    		    			    	
    		__('5') => __('小一'),
    		__('6') => __('小二'),
    		__('7') => __('小三'),
    		__('8') => __('小四'),
    		__('9') => __('小五'),
    		__('10') => __('小六'),   		
    		__('11') => __('中一'),
    		__('12') => __('中二'),
    		__('13') => __('中三'),
    		__('14') => __('中四'),
    		__('15') => __('中五'),		    			    	
    		__('16') => __('中六'),
    		__('17') => __('Grade 1'),   		
    		__('18') => __('Grade 2'),
    		__('19') => __('Grade 3'),
    		__('20') => __('Grade 4'),
    		__('21') => __('Grade 5'),
    		__('22') => __('Grade 6'),		    			    	
    		__('23') => __('Grade 7'), 
    		__('24') => __('Grade 8'),     		   		
    		__('25') => __('Grade 9'),
    		__('26') => __('Grade 10'),
    		__('27') => __('Grade 11'),
    		__('28') => __('Grade 12'),		    			    	  
	    	__('29') => __('Undergraduate Year 1'),
	    	__('30') => __('Undergraduate Year 2'),
	    	__('31') => __('Undergraduate Year 3'),
	    	__('32') => __('Master'),
	    	__('33') => __('PhD'), 		
    		__('34') => __('一級'),
    		__('35') => __('二級'),
    		__('36') => __('三級'),
    		__('37') => __('四級'),
    		__('38') => __('五級'),
    		__('39') => __('六級'),
    		__('40') => __('七級'),
    		__('41') => __('八級'),
    		__('42') => __('演奏級'),
	    	__('43') => __('成人')
	    );

		$this->select_frequency = array(
			'1' => __('每星期1堂'),
			'2' => __('每星期2堂'),
			'3' => __('每星期3堂'),
			'4' => __('每星期4堂'),	
			'5' => __('每星期5堂'),	    				    		
			'6' => __('每星期6堂'),
			'7' => __('每星期7堂'),	    		
	    );

		/*
		 * Remember to update the javascript for timepicker in step 2 and extend form, and also AppModel
		 */
	    $this->select_duration = array(
	    	'1' => __('每堂1小時'),		    	
	    	'1.5' => __('每堂1.5小時'),
	    	'2' => __('每堂2小時'),
	    	'2.5' => __('每堂2.5小時'),
	    	'3' => __('每堂3小時')		    		
	    );

	    $this->select_condition = array(
	    	__('每日') => __('每日'),		    	
	    	__('逢星期一至五') => __('逢星期一至五'),
	    	__('逢星期一三五') => __('逢星期一三五'),
	    	__('逢星期二四') => __('逢星期二四'),
	    	__('逢星期六日') => __('逢星期六日'),
	    	__('逢星期一') => __('逢星期一'),
	    	__('逢星期二') => __('逢星期二'),
	    	__('逢星期三') => __('逢星期三'),
	    	__('逢星期四') => __('逢星期四'),
	    	__('逢星期五') => __('逢星期五'),
	    	__('逢星期六') => __('逢星期六'),
	    	__('逢星期日') => __('逢星期日'),
	    );

	    $this->select_first_condition = array(    	
	    	__('一至五') => __('一至五'),
	    	__('星期六日') => __('星期六日'),
	    	__('星期一') => __('星期一'),
	    	__('星期二') => __('星期二'),
	    	__('星期三') => __('星期三'),
	    	__('星期四') => __('星期四'),
	    	__('星期五') => __('星期五'),
	    	__('星期六') => __('星期六'),
	    	__('星期日') => __('星期日'),
	    );

	    $this->select_rate = array(    	
	    	__('/hr') => __('每小時'),
	    	__('/45min') => __('每45分鐘（補音樂）'),
	    );

	    $this->select_tutor_type = array(
    		__('補習') => array(
    			__('應屆DSE考生') => __('應屆DSE考生'),
    			__('大學程度／大學畢業') => __('大學程度／大學畢業'),	
    			__('現職教師／全職補習導師') => __('現職教師／全職補習導師'),	
    			__('外籍導師') => __('外籍導師')
    		),
    		__('音樂') => array(
    			__('五級或以上') => __('五級或以上'),	
    			__('八級或以上') => __('八級或以上'),	
    			__('演奏級') => __('演奏級')
    		)
    	);

	    $this->select_profile_tutor_type = array(
			__('應屆DSE考生') => __('應屆DSE考生'),	    	
			__('大學程度') => __('大學程度'),	
			__('大學畢業') => __('大學畢業'),	
			__('現職教師') => __('現職教師'),	
			__('全職補習導師') => __('全職補習導師'),	    			
			__('外籍導師') => __('外籍導師')
    	);

	    $this->select_profile_tutor_type_education = array(
    		__('高中畢業（DSE）') => __('高中畢業（DSE）'),
    		__('大學生') => __('大學生'),
    		__('大學畢業') => __('大學畢業'),
    		__('碩士學位') => __('碩士學位'),
    		__('博士學位') => __('博士學位')    		
    	);       	

	    $this->select_profile_tutor_type_music = array(
			__('五級或以上') => __('五級或以上'),	
			__('八級或以上') => __('八級或以上'),	
			__('演奏級') => __('演奏級')
    	);    

	    $this->select_profile_tutor_type_language = array(
    		__('初級') => __('初級'),
    		__('中級') => __('中級'),
    		__('高級') => __('高級')
    	);       	 	  	

    	$this->select_gender = array(
	    	__('男') => __('男'),		    	
	    	__('女') => __('女')
	    );

	    $this->select_number = array(
	    	__('2') => __('2'),
	    	__('3') => __('3'),
	    	__('4') => __('4'),
	    	__('5') => __('5'),
	    	__('6') => __('6'),
	    	__('7') => __('7'),
	    	__('8') => __('8'),
	    	__('9') => __('9'),
	    	__('10') => __('10')
	    );

	    $i = 0;
		$this->select_year = array();
		while ((date("Y") - 56) + $i++ < date("Y")) {
			$this->select_year[(date("Y") - 56) + $i] = (date("Y") - 56) + $i; 
		}
	}
}